hsSphere_rcf_qtr_noAMR/constant/ignore.dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

dynamicRefineFvMeshCoeffs
{
    // How often to refine
    refineInterval  100; //20;
    // Field to be refinement on
    field           mag(grad(p));
    // Refine field inbetween lower..upper
    lowerRefineLevel 5e4;
    upperRefineLevel  1e20;
    // If value < unrefineLevel unrefine
     unrefineLevel   3e4;
    // Have slower than 2:1 refinement
    nBufferLayers   2;
    // Refine cells only up to maxRefinement levels
    maxRefinement   4;
    // Stop refinement if maxCells reached
    maxCells        1000000;
    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
      //    (phi U)
      //    (phia Ua)
    );
    // Write the refinement level as a volScalarField
    dumpLevel       true;
}

// ************************************************************************* //
